---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsetsInNestedFamily
source: html/3b1ad4d2-8e3a-d0aa-e9cc-d5dd841c9542.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsetsInNestedFamily Property

Instance of family [Family Name] can't be updated because in nested family the column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSlantedColumnOffsetsInNestedFamily { get; }
```